nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO6_9 (coord A2), U82K[A2]/U68A[63]
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_WL_RST_PERIPHERAL GPIO6          /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_WL_RST_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_WL_RST_CHANNEL 9                 /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFIPINS_WL_RST_GPIO GPIO6                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFIPINS_WL_RST_GPIO_PIN_MASK (1U << 9U)  /*!<@brief GPIO pin mask */
#define BOARD_INITWIFIPINS_WL_RST_PORT 6U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_WL_RST_PIN 9U                    /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_WL_RST_PIN_MASK (1U << 9U)       /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO4_11 (coord B14), PDN
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_PDN_PERIPHERAL GPIO4                   /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_PDN_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_PDN_CHANNEL 11                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFIPINS_PDN_GPIO GPIO4                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFIPINS_PDN_GPIO_PIN_MASK (1U << 11U)          /*!<@brief GPIO pin mask */
#define BOARD_INITWIFIPINS_PDN_PORT 4U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_PDN_PIN 11U                            /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_PDN_PIN_MASK (1U << 11U)               /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_31 (coord V21), U82E[V21]/U9[3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_SIGNAL P0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO1_0 (number AD25), U82F[AD25]/U9[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_SIGNAL P1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN_MASK (1U << 0U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM 0x3000u    /*!<@brief Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

