nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
/*! @name PIO7_3 (coord C21), U82L[C21]/U72[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SD_VSELECT_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SD_VSELECT_CHANNEL 3                 /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDCARDPINS_SD_VSELECT_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_VSELECT_GPIO_PIN_MASK (1U << 3U)  /*!<@brief GPIO pin mask */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO7_0 (coord B22), U82L[B22]/U72[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PIN 0U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PIN_MASK (1U << 0U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_1 (coord B20), U82L[B20]/U72[C1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PIN 1U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PIN_MASK (1U << 1U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_6 (coord A22), U82L[A22]/U72[D1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN 6U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN_MASK (1U << 6U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_7 (coord A20), U82L[A20]/U72[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PIN 7U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PIN_MASK (1U << 7U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_9 (coord B23), U82L[B23]/U72[B1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PIN 9U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PIN_MASK (1U << 9U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_8 (coord C22), U82L[C22]/U72[A1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PIN 8U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PIN_MASK (1U << 8U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_11 (coord F18), U82L[F18]/U72[B2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PERIPHERAL GPIO7
/*!
 * @brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_CHANNEL 11

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_GPIO GPIO7
/*!
 * @brief GPIO pin mask */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_GPIO_PIN_MASK (1U << 11U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PORT 7U
/*!
 * @brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PIN_MASK (1U << 11U)
/* @} */

/*! @name PIO7_10 (coord A24), U82L[A24]/Q19[1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_CHANNEL 10                /*!<@brief Signal channel */

