nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
/*! @name PIO0_2 (coord T24), U82E[D24]/U29[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_RXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_RXD0_SIGNAL RXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_RXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN 2U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN_MASK (1U << 2U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_3 (coord T25), U82E[T25]/U29[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_SIGNAL TX_BCLK            /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_4 (coord V25), U82E[V25]/U29[D1]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TXD0_SIGNAL TXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN 4U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN_MASK (1U << 4U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_5 (coord T23), U82E[T23]/U29[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_SIGNAL TX_SYNC            /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN 5U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN_MASK (1U << 5U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_21 (number AB25), U82E[AB25]/U29[G7]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_MCLK_PERIPHERAL CLKCTL0                 /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_MCLK_SIGNAL MCLK                        /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_MCLK_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_MCLK_PIN 21U                            /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_MCLK_PIN_MASK (1U << 21U)               /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_10 (coord V23), U82E[V23]/SW5[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINSBUTTON_SW5_PERIPHERAL GPIO0
/*!
 * @brief Signal name */
#define BOARD_INITPINSBUTTON_SW5_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITPINSBUTTON_SW5_CHANNEL 10

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINSBUTTON_SW5_GPIO GPIO0
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINSBUTTON_SW5_GPIO_PIN_MASK (1U << 10U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINSBUTTON_SW5_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINSBUTTON_SW5_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINSBUTTON_SW5_PIN_MASK (1U << 10U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_13 (number AD23), U82F[AD23]/Q5[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_PERIPHERAL GPIO1
/*!
 * @brief Signal name */
#define BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_CHANNEL 13

