nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
/*! @name PIO5_9 (coord H1), U82J[H1]/U81[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PERIPHERAL XSPI1         /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_CHANNEL 7                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA7_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_10 (coord K2), U82J[K2]/U81[B2]/U80[6]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_SIGNAL SCLK0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_SCLK0_PIN_MASK (1U << 10U)
/* @} */

/*! @name PIO5_11 (coord K1), U82J[K1]/U68B[50]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_SDHC1_INIT_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_SDHC1_INIT_SIGNAL SS1_N              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_SDHC1_INIT_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_SDHC1_INIT_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_SDHC1_INIT_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_12 (coord K3), U82J[K3]/U81[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_CHANNEL 8                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA8_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_13 (coord M3), U82J[M3]/U81[B1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_CHANNEL 9                 /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA9_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO5_14 (coord L2), U82J[L2]/U81[A2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_CHANNEL 10                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA10_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_15 (coord M1), U82J[M1]/U81[A4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_CHANNEL 11                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA11_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_16 (coord M2), U82J[M2]/U81[B3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_SIGNAL DQS1               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DQS1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_17 (coord P1), U82J[P1]/U81[A5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_CHANNEL 12                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA12_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_18 (coord P2), U82J[P2]/U81[B4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_CHANNEL 13                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA13_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_19 (coord N3), U82J[N3]/U81[B5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_CHANNEL 14                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA14_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO5_20 (coord P3), U82J[P3]/U81[C5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PERIPHERAL XSPI1          /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_CHANNEL 15                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA15_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI1Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

