nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_11 (number AD22), U82F[AD22]/U68B[54]
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PERIPHERAL LP_FLEXCOMM2     /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_SIGNAL P0                   /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PIN 11U                     /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_RXD_PIN_MASK (1U << 11U)        /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_12 (number AE22), U82F[AE22]/U68B[26]
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PERIPHERAL LP_FLEXCOMM2     /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_SIGNAL P1                   /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PIN 12U                     /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_TXD_PIN_MASK (1U << 12U)        /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_14 (number AE24), U82F[AE24]/U68B[25]
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PERIPHERAL LP_FLEXCOMM2     /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_SIGNAL P2                   /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PORT 1U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PIN 14U                     /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_RTS_PIN_MASK (1U << 14U)        /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_15 (coord Y21), U82F[Y21]/U68B[27]
  @{ */
/* Routed pin properties */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PERIPHERAL LP_FLEXCOMM2    /*!<@brief Peripheral name */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_SIGNAL P3                  /*!<@brief Signal name */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PORT 1U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PIN 15U                    /*!<@brief PORT pin number */
#define BOARD_INITBT_UARTPINS_BT_UART_CTS_PIN_MASK (1U << 15U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBT_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_19 (coord V3), U82L[V3]/U68B[23]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_DATA0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO7_20 (coord Y2), U82L[Y2]/U68B[20]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_DATA1_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO7_21 (coord R2), U82L[R2]/U68B[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_DATA2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO7_22 (coord T2), U82L[T2]/U68B[21]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_DATA3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

