nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.h
/*! @name PIO7_18 (coord T3), U82L[T3]/U68B[19]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_CMD_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_CMD_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_CMD_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO7_17 (coord U3), U82L[U3]/U68B[48]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHC1PINS_SDHC1_CLK_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITSDHC1PINS_SDHC1_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITSDHC1PINS_SDHC1_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC1PINS_SDHC1_CLK_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC1PINS_SDHC1_CLK_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC1Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */


#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsOctalFlash(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
